# PathType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..PathType Property
ImageType Class See Also
---
The path type that was used to refer to the file from which the ImageType was loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public PathType PathType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathType As PathType
	Get
```

Visual C++
---
```text
public:
property PathType PathType {
	PathType get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace